<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%payer}}`.
 */
class m250130_202226_create_payer_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('{{%payer}}', [
            'id' => $this->primaryKey(),
            'name' => $this->string()->notNull()->unique()->comment('Назва'),
            'email' => $this->string()->null()->unique()->comment('Електронна пошта'),
            'phone' => $this->string()->null()->unique()->comment('Телефон'),
            'contract' => $this->string()->null()->unique()->comment('Договір'),
            'director' => $this->string()->null()->comment('Директор ПІБ'),
            'director_case' => $this->string()->null()->comment('ПІБ директора в родовому відмінку'),
            'requisites' => $this->text()->null()->comment('Реквізити'),
            'created_at' => $this->dateTime()->notNull()->defaultExpression('CURRENT_TIMESTAMP')->comment('Дата створення'),
        ]);

        $this->createIndex(
            'idx-payer-name',
            'payer',
            'name'
        );


        // Добавление данных в таблицу
        $this->batchInsert('{{%payer}}',
            ['id', 'name', 'email', 'phone', 'contract', 'director', 'director_case', 'requisites', 'created_at'],
            [
//                [1, 'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «СКАЙФІТ»', null, '+380445911857', 'СФ-49/У', 'Горовий Сергій Миколайович', null, '<p><strong>ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «СКАЙФІТ»</strong><br>Код ЄДРПОУ 41379795<br>...</p>', '2003-06-20 00:00:00'],
//                [2, 'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «ТЕХНО КРАФТ»', null, '+380442246590', 'ТКФ-49/У', 'Білий Андрій Вікторович', null, '<p><strong>ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «ТЕХНО КРАФТ»</strong><br>Код ЄДРПОУ 40052384<br>...</p>', '2003-06-20 00:00:00'],
//                [3, 'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «ТЕРАКАТ»', null, null, 'ТК-45/У', null, null, '', '2003-06-20 00:00:00'],
//                [4, 'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «УКРАЇНСЬКА БУРОВА КОМПАНІЯ»', null, null, 'КФ-3/У', null, null, '', '2001-11-20 00:00:00'],
//                [5, 'ПРИВАТНЕ ПІДПРИЄМСТВО «КОМПАНІЯ «НАДЕЖДА»', null, null, null, 'Батраченко Віктор Володимирович', 'Батраченка Віктора Володимировича', '<p><strong>ПП «КОМПАНІЯ «НАДЕЖДА»</strong><br>...</p>', null],
//                [6, 'КП"Полтавський обласний  центр ЕМД та МК ПОР"', null, null, null, null, null, '', null],
//                [7, 'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «КЕМ-ФЛАЙТ»', null, '+380443333271', 'КФ-3/У', 'Білий Андрій Вікторович', null, '<p>ТОВ «КЕМ-ФЛАЙТ»<br>...</p>', '2001-11-20 00:00:00'],
//                [8, 'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «АРИСТОКРАТ І»', null, null, '22', 'Балковий Юрій Володимирович', 'Балковий Юрій Володимирович', '<p><strong>ТОВ «АРИСТОКРАТ І»</strong><br>...</p>', '2011-02-20 00:00:00'],
//                [9, 'PRIME Technics, HOUSETECH', null, null, 'PR-240220', 'Грабовський Микола Анатолійович', 'Грабовського Миколи Анатолійовича', '<p><strong>Приватне підприємство "Коннект"</strong><br>...</p>', '2024-02-20 00:00:00'],
//                [10, 'Фізична особа - підприємець КОНУХ АННА ОЛЕГІВНА', null, null, '1302/20SK', 'Конух А. О.', 'Конух А. О.', '<p><strong>Фізична особа - підприємець КОНУХ АННА ОЛЕГІВНА</strong><br>...</p>', '2014-01-20 00:00:00'],
//                [11, 'Товариство з обмеженою відповідальністю «МАКС ВЕНТО»', null, '+380444286573', null, 'Ковтун О.В.', 'Ковтуна Олександра Вікторовича', '<p><strong>ТОВ "Макс Венто"</strong><br>...</p>', null],
//                [12, ' ПРИВАТНЕ АКЦІОНЕРНЕ ТОВАРИСТВО  "ПОЛТАВСЬКЕ ХЛІБОПРИЙМАЛЬНЕ ПІДПРИЄМСТВО"', null, null, null, null, null, '<p>36014, м. Полтава, площа Павленківська, 24,&nbsp; (0532) т/ф 50-34-00</p>...', null],
//                [13, 'Техмаинвест', null, null, null, null, null, '', null],
//                [14, 'Фізична особа - підприємець ЛЯВА ЮЛІЯ МИКОЛАЇВНА', null, null, '1302/20SL', 'Лява Юлия Миколаївна', 'Ляви Юлії Миколаївни', '<p style="text-align:justify">Зареєстрована за адресою :</p>...', '2015-05-20 00:00:00'],
//                [15, 'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛНІСТЮ "НАШ СЕРВІС"', null, null, '1302/21S', 'Кобець Євгеній Анатолійович', 'Кобця Євгена Анатолійовича', '<p>м. Київ, 04060, вул. Щусєва, 44.</p>...', '2020-05-20 00:00:00'],
//                [16, 'Приватне акціонерне товариство ” НОВОМИКОЛАЇВСЬКИЙ МОЛОКОЗАВОД”', null, null, '9', 'Павелко Микола Олександрович', 'Павелко Миколи Олександровича', '<p><strong>ЗАМОВНИК:</strong></p>...', '2014-01-20 00:00:00'],
//                [17, 'ФОП Карманенко М.I.', null, null, '10', 'Карманенко Максим Iванович', 'Карманенко Максима Iвановича', '<p><strong>ФОП Карманенко М.I.</strong></p>...', '2015-02-20 00:00:00'],
//                [20, 'Товариство з обмеженою відповідальністю "Пегас-СК"', null, null, '01/21', 'Голубцов Валерій Миколайович', 'Голубцова Валерія Миколайовича', '<p>Юридична адреса: 04073, м.Київ, вул. Сирецька, 9</p>...', '2027-04-20 00:00:00'],
//                [21, 'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ "НАШ СЕРВІС"', null, null, '1302/21S', 'Кобець Євгеній Анатолійович', 'Кобця Євгена Анатолійовича', '<p>м. Київ, 04060, вул. Щусєва, 44.</p>...', '2020-05-20 00:00:00'],
                [22, 'ТОВ «ІНГСОТ»', null, null, 'IT/01', 'Гринюк Сергій Анатолійович', 'Гринюк Сергія Анатолійовича', '<p><b>ТОВ «ІНГСОТ»</b><br />
<b>Ідентифікаційний код ЄДРПОУ: </b>37400930<br />
<b>Свідоцтво ПДВ:</b> №100311766<br />
<b>Індивідуальний податковий: </b>№374009326557<br />
<b>Банк ПАТ:</b> &laquo;УкрСиббанк&raquo;<br />
<b>МФО:</b> 351005<br />
<b>IBAN:</b> UA073510050000026000301435500<br />
<b>Адреса:</b> 01001, м. Київ, вул. Еспланадна, 20</p>
', '2023-05-20 00:00:00'],

            ]
        );

    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('{{%payer}}');
    }
}
